In [1]:
import pandas as pd

In [61]:
#print first 7 reacords
df = pd.read_csv('student_records.csv')
df.head(7)

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4
0,1,Alice,New York,123-456-7890,Science,85,87,88,86
1,2,Bob,Los Angeles,234-567-8901,BCA,78,80,79,77
2,3,Charlie,Rajkot,345-678-9012,Arts,92,91,90,89
3,4,David,Houston,456-789-0123,BCA,88,89,85,87
4,5,Eva,Phoenix,567-890-1234,Commerce,76,77,75,74
5,6,Frank,Philadelphia,678-901-2345,Arts,95,96,94,93
6,7,Grace,San Antonio,789-012-3456,MCA,80,82,81,83

In [40]:
#display columns name
print(df.columns.tolist())

['Id', 'Name', 'City', 'Contact Details', 'Stream', 'Mark1', 'Mark2', 'Mark3', 'Mark4']

In [60]:
#print the statestical informantion of datafreame
df.describe()

,Id,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
count,15.000000,15.000000,15.000000,15.000000,15.000000,15.000000,15.000000
mean,8.000000,85.466667,85.866667,84.533333,84.133333,340.000000,85.000000
std,4.472136,6.243473,5.553206,5.829318,5.423055,22.703052,5.675763
min,1.000000,76.000000,77.000000,75.000000,74.000000,302.000000,75.500000
25%,4.500000,80.500000,81.500000,80.000000,80.000000,322.500000,80.625000
50%,8.000000,85.000000,85.000000,84.000000,85.000000,337.000000,84.250000
75%,11.500000,91.000000,90.000000,89.500000,88.000000,358.000000,89.500000
max,15.000000,95.000000,96.000000,94.000000,93.000000,378.000000,94.500000

In [59]:
#print all the record of dataframe in alphabetical orders.
df.sort_values(by='Name')

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
0,1,Alice,New York,123-456-7890,Science,85,87,88,86,346,86.50
1,2,Bob,Los Angeles,234-567-8901,BCA,78,80,79,77,314,78.50
2,3,Charlie,Rajkot,345-678-9012,Arts,92,91,90,89,362,90.50
3,4,David,Houston,456-789-0123,BCA,88,89,85,87,349,87.25
4,5,Eva,Phoenix,567-890-1234,Commerce,76,77,75,74,302,75.50
5,6,Frank,Philadelphia,678-901-2345,Arts,95,96,94,93,378,94.50
6,7,Grace,San Antonio,789-012-3456,MCA,80,82,81,83,326,81.50
7,8,Hannah,San Diego,890-123-4567,Commerce,83,84,82,85,334,83.50
8,9,Ivy,Rajkot,901-234-5678,Arts,90,88,89,87,354,88.50
9,10,Jack,San Jose,012-345-6789,Science,86,85,84,82,337,84.25
10,11,Kara,Austin,123-456-7809,MCA,79,81,78,80,318,79.50
11,12,Leo,Rajkot,234-567-8910,Arts,94,93,92,90,369,92.25
12,13,Mona,Fort Worth,345-678-9011,Science,81,83,79,80,323,80.75
13,14,Nina,Columbus,456-789-0122,Commerce,82,80,81,79,322,80.50
14,15,Oscar,Rajkot,567-890-1233,BCA,93,92,91,90,366,91.50

In [58]:
#print all the records of datafreame in a way that the students having highest mark display the first.
df['Total Marks'] = df[['Mark1', 'Mark2', 'Mark3', 'Mark4']].sum(axis=1)
df_sorted = df.sort_values(by='Total Marks', ascending=False)
df_sorted

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
5,6,Frank,Philadelphia,678-901-2345,Arts,95,96,94,93,378,94.50
11,12,Leo,Rajkot,234-567-8910,Arts,94,93,92,90,369,92.25
14,15,Oscar,Rajkot,567-890-1233,BCA,93,92,91,90,366,91.50
2,3,Charlie,Rajkot,345-678-9012,Arts,92,91,90,89,362,90.50
8,9,Ivy,Rajkot,901-234-5678,Arts,90,88,89,87,354,88.50
3,4,David,Houston,456-789-0123,BCA,88,89,85,87,349,87.25
0,1,Alice,New York,123-456-7890,Science,85,87,88,86,346,86.50
9,10,Jack,San Jose,012-345-6789,Science,86,85,84,82,337,84.25
7,8,Hannah,San Diego,890-123-4567,Commerce,83,84,82,85,334,83.50
6,7,Grace,San Antonio,789-012-3456,MCA,80,82,81,83,326,81.50
12,13,Mona,Fort Worth,345-678-9011,Science,81,83,79,80,323,80.75
13,14,Nina,Columbus,456-789-0122,Commerce,82,80,81,79,322,80.50
10,11,Kara,Austin,123-456-7809,MCA,79,81,78,80,318,79.50
1,2,Bob,Los Angeles,234-567-8901,BCA,78,80,79,77,314,78.50
4,5,Eva,Phoenix,567-890-1234,Commerce,76,77,75,74,302,75.50

In [57]:
#add column "percentage" in avbove dataframe and assign the calculated percentage based on marks.
total_possible_marks = 400 
df['Percentage'] = (df['Total Marks'] / total_possible_marks) * 100

df_sorted = df.sort_values(by='Total Marks', ascending=False)

df_sorted

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
5,6,Frank,Philadelphia,678-901-2345,Arts,95,96,94,93,378,94.50
11,12,Leo,Rajkot,234-567-8910,Arts,94,93,92,90,369,92.25
14,15,Oscar,Rajkot,567-890-1233,BCA,93,92,91,90,366,91.50
2,3,Charlie,Rajkot,345-678-9012,Arts,92,91,90,89,362,90.50
8,9,Ivy,Rajkot,901-234-5678,Arts,90,88,89,87,354,88.50
3,4,David,Houston,456-789-0123,BCA,88,89,85,87,349,87.25
0,1,Alice,New York,123-456-7890,Science,85,87,88,86,346,86.50
9,10,Jack,San Jose,012-345-6789,Science,86,85,84,82,337,84.25
7,8,Hannah,San Diego,890-123-4567,Commerce,83,84,82,85,334,83.50
6,7,Grace,San Antonio,789-012-3456,MCA,80,82,81,83,326,81.50
12,13,Mona,Fort Worth,345-678-9011,Science,81,83,79,80,323,80.75
13,14,Nina,Columbus,456-789-0122,Commerce,82,80,81,79,322,80.50
10,11,Kara,Austin,123-456-7809,MCA,79,81,78,80,318,79.50
1,2,Bob,Los Angeles,234-567-8901,BCA,78,80,79,77,314,78.50
4,5,Eva,Phoenix,567-890-1234,Commerce,76,77,75,74,302,75.50

In [56]:
#print the deatails of studnets who lives in rajkot.
df[df['City'] == 'Rajkot']

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
2,3,Charlie,Rajkot,345-678-9012,Arts,92,91,90,89,362,90.50
8,9,Ivy,Rajkot,901-234-5678,Arts,90,88,89,87,354,88.50
11,12,Leo,Rajkot,234-567-8910,Arts,94,93,92,90,369,92.25
14,15,Oscar,Rajkot,567-890-1233,BCA,93,92,91,90,366,91.50

In [55]:
#print the students whose name starts with 'M'
df[df['Name'].str.startswith('M')]

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
12,13,Mona,Fort Worth,345-678-9011,Science,81,83,79,80,323,80.75

In [54]:
#print the student having maximum percentage
df.loc[df['Percentage'].idxmax()]

Id                            6
Name                      Frank
City               Philadelphia
Contact Details    678-901-2345
Stream                     Arts
Mark1                        95
Mark2                        96
Mark3                        94
Mark4                        93
Total Marks                 378
Percentage                 94.5
Name: 5, dtype: object

In [52]:
#print the student having maximum percentage
idx_min = df['Percentage'].idxmin()
df.loc[idx_min]

Id                            5
Name                        Eva
City                    Phoenix
Contact Details    567-890-1234
Stream                 Commerce
Mark1                        76
Mark2                        77
Mark3                        75
Mark4                        74
Total Marks                 302
Percentage                 75.5
Name: 4, dtype: object

In [51]:
#print the studnets who study in BCA and MCA
df[df['Stream'].isin(['BCA', 'MCA'])]

,Id,Name,City,Contact Details,Stream,Mark1,Mark2,Mark3,Mark4,Total Marks,Percentage
1,2,Bob,Los Angeles,234-567-8901,BCA,78,80,79,77,314,78.50
3,4,David,Houston,456-789-0123,BCA,88,89,85,87,349,87.25
6,7,Grace,San Antonio,789-012-3456,MCA,80,82,81,83,326,81.50
10,11,Kara,Austin,123-456-7809,MCA,79,81,78,80,318,79.50
14,15,Oscar,Rajkot,567-890-1233,BCA,93,92,91,90,366,91.50